app/controllers/events_controller.rb

  def data
    events = Event.all
---
SELECT `events`.* FROM `events`

    def db_action

      mode = params["!nativeeditor_status"]
      id = params[:id]
      start_date = params[:start_date]
      end_date = params[:end_date]
      text = params[:text]
      print "DB ACTION : "+id+"\n\n"

      case mode
        when "inserted"
          #event = Event.create( :begin => start_date, :begin => end_date, :name => text)
          event = Event.create(name: text, begin: start_date, end: end_date, description: "");
            tid = event.id
            print "DB ACTION : INSERTED!!!!! \n \n "
        when "deleted"
          Event.find(id).destroy
          tid = id

        when "updated"
          event = Event.find(id)
          event.begin = start_date
          event.end = end_date
          event.name = text
          event.save
---
INSERT INTO `events` (`name`, `description`, `begin`, `end`) VALUES ('New event', '', '2017-12-01 02:05:00', '2017-12-01 04:00:00')
UPDATE `events` SET `name` = 'yaaa1' WHERE `events`.`id` = 15

    def index
      @events = Event.all;
---
SELECT `events`.* FROM `events`

    def update
      #@event = Event.find(params[:id])
      @event.update(name: params[:title], begin: params[:begin], end: params[:end],
        description: params[:description]);
---
UPDATE `events` SET `end` = '2017-02-01 02:00:00', `description` = '  ooook' WHERE `events`.`id` = 6

      def create
        Event.create(name: params[:title], begin: params[:begin], end: params[:end], description: params[:description]);
---
INSERT INTO `events` (`name`, `description`, `begin`, `end`) VALUES ('yaaa', 'fofogogo', '2017-01-21 00:00:00', '2017-07-31 00:00:00')

        def destroy
          @event.destroy;
---
DELETE FROM `events` WHERE `events`.`id` = 1